Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །དེ་ལ་ཀུན་བརྟགས་པ་རྣམས་མཚན་ཉིད་མེད་པར་མཐོང་བ་ནི་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ཏོ། །ཡོངས་སུ་གྲུབ་པ་ལ་ཞི་བའི་མཚན་ཉིད་དུ་མཐོང་བ་ནི་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་ཏོ། །གཞན་གྱི་དབང་ལ་མི་མཐུན་པར་མཐོང་བ་ནི་སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ཏོ།
en: Seeing that the falsely imagined are without marks is “the emptiness meditative stabilization”; seeing thoroughly established phenomena as having the mark of calmness is “the signless meditative stabilization”; and seeing other-powered phenomena as discordant is “the wishless meditative stabilization.”

source: །དེ་ལ་ཀུན་བརྟགས་པའི་མཚན་ཉིད་རྣམས་ཤིན་ཏུ་མེད་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་ཀྱི་རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་དུ་སོ་སོར་རྟོག་པའི་ཚེ། སེམས་གནས་པ་གང་ཡིན་པ་དེ་ནི་སྟོང་པ་ཉིད་ཀྱི་རྣམ་པར་ཐར་པའི་སྒོ་སྟེ།
en: There, because of the absolute nonexistence of what is marked as falsely imagined, it says “that which is the stability of mind when it understands analytically that all dharmas are empty of their own marks is the emptiness gateway to liberation.

source: འདི་ནི་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ཞེས་བྱའོ་ཞེས་གསུངས་སོ།
en: It is called the emptiness meditative stabilization.”

source: །ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་ཀྱིས་ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པའི་མཚན་ཉིད་ཡིན་པས། ཆོས་ཐམས་ཅད་མཚན་མ་མེད་པར་སོ་སོར་རྟོག་པའི་ཚེ། སེམས་གནས་པ་གང་ཡིན་པ་ནི་མཚན་མ་མེད་པའི་རྣམ་པར་ཐར་པའི་སྒོ་སྟེ།
en: Because it is the mark of a thoroughly established phenomenon, all dharmas are marked by signlessness, so it says “that which is the stability of mind when it understands analytically that all dharmas are without a causal sign is the signlessness gateway to liberation.

source: འདི་ནི་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་ཞེས་བྱའོ་ཞེས་གསུངས་སོ།
en: It is called the signlessness meditative stabilization.”

source: །ཆོས་ཉིད་རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པ་ལ་གློ་བུར་གྱི་ཉོན་མོངས་པ་ལ་སོགས་པའི་རྒྱུས་ཡོད་པ་མ་ཡིན་པ་ལ་མངོན་པར་འདུ་བྱེད་པ། བསོད་ནམས་དང་། བསོད་ནམས་མ་ཡིན་པ་དང་། མི་གཡོ་བའི་མཚན་ཉིད་གང་ཡིན་པ་དེ་དོན་དམ་པར་མེད་པའི་ཕྱིར། ཆོས་ཐམས་ཅད་མངོན་པར་འདུ་བྱེད་པ་མེད་པས། ཆོས་ཐམས་ཅད་མངོན་པར་འདུ་བྱེད་པ་མེད་དོ་ཞེས་སོ་སོར་རྟོག་པའི་ཚེ།
en: Because it is pure in its true dharmic nature and, because it is caused by afflictions and so on plucked out of thin air, it is not something that exists, that which is the occasioning of anything marked as meritorious, unmeritorious, or immovable does not ultimately exist, so, since all dharmas do not occasion anything, it says “that which is the stability of mind when it understands analytically that all dharmas do not occasion anything is the wishlessness gateway to liberation.

source: སེམས་གནས་པ་གང་ཡིན་པ་ནི་སྨོན་པ་མེད་པའི་རྣམ་པར་ཐར་པའི་སྒོ་སྟེ་འདི་ནི་སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ཞེས་བྱའོ་ཞེས་གསུངས་སོ།
en: It is called the wishlessness meditative stabilization.”

source: །ཤེས་པའི་ཐེག་པ་ཆེན་པོ་ལ་ཤེས་པ་བཅུ་གཅིག་པོ་རྣམས་ནི་ཐེག་པ་ཆེན་པོ་སྟེ།
en: 12. Great Vehicle of the knowledges In regard to the Great Vehicle of the knowledges, all “eleven knowledges” are the Great Vehicle.

source: དེ་ལ་འདི་ནི་སྡུག་བསྔལ་ལོ།
en: Among these, “This is suffering.

source: །འདི་ལྟར་སྡུག་བསྔལ་ཀུན་འབྱུང་ངོ་།
en: This is the origin of suffering.

source: །འདི་ལྟར་སྡུག་བསྔལ་འགོག་པའོ།
en: This is the cessation of suffering.

source: །འདི་ལྟར་སྡུག་བསྔལ་ཕྱིས་མི་སྐྱེའོ་ཞེས་བྱ་བ་ནི་སྡུག་བསྔལ་ཤེས་པའོ།
en: This is suffering not produced in the future,” “is knowledge of suffering.”

source: །རྣམ་པ་བཞིར་གྱུར་དུ་ཟིན་ཀྱང་ཐ་མ་བཟུང་ནས། ཕྱི་མ་ལ་སྡུག་བསྔལ་མི་སྐྱེ་ཞིང་རྒྱུན་ཆད་དོ་ཞེས་དེ་ལྟར་ཞུགས་པའི་ཤེས་པ་ལ། འདིར་སྡུག་བསྔལ་ཤེས་པ་ཞེས་བྱ་སྟེ།
en: Even though it is in four parts, here, having taken up the last, knowledge of the fact that suffering will not arise in the future—that its continuum is cut—it “is called knowledge of suffering.”

source: དེ་བས་ན་གང་སྡུག་བསྔལ་མི་སྐྱེ་བར་ཤེས་པའོ་ཞེས་གསུངས་སོ།
en: Therefore, it says it is “knowledge that suffering is not produced.” “

source: །ཀུན་འབྱུང་བ་སྤངས་པར་ཤེས་པའོ་ཞེས་བྱ་བ་ནི་ཀུན་འབྱུང་བའི་བདག་ཉིད་ཉོན་མོངས་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་དང་ལས་རྣམས་སྤངས་པར་ཤེས་པ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Knowledge of the abandonment of origination” means knowledge that all the primary afflictions and the secondary afflictions and the karma that constitute the origin have been eliminated. “

source: །གང་སྡུག་བསྔལ་འགོག་པར་ཤེས་པའོ་ཞེས་བྱ་བ་ནི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་དག་ཟད་པར་ཤེས་པའོ།
en: The knowledge of the cessation of suffering” is knowledge that the five appropriating aggregates are extinguished. “

source: །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཤེས་པའོ་ཞེས་བྱ་བ་ནི་ལམ་འདི་དང་རྟོགས་པ་འདིས་སྡུག་བསྔལ་འགགས་པས་སྡུག་བསྔལ་འགོག་པའི་རྒྱུ་ཤེས་པའོ། །གང་འདོད་ཆགས་དང་།
en: The knowledge of the eightfold noble path” is knowledge of the cause of the cessation of suffering, that this path and this realization block suffering. “

source: ཞེ་སྡང་དང་གཏི་མུག་ཟད་པར་ཤེས་པ་ཞེས་བྱ་བ་ནི་བྱས་པ་སྲུང་བ་ཅན་གྱི་ས་ལ་སྟེ།
en: The knowledge that greed, hatred, and confusion have been extinguished” is on the Kṛtāvin level.

source: དེ་ལ་ཤེས་པ་ནི་མངོན་སུམ་གྱི་ཤེས་པའོ།
en: This knowledge directly perceives it. “

source: །སྲིད་པའི་འགྲོ་བ་མི་སྐྱེ་བར་ཤེས་པ་གང་ཡིན་པ་ཞེས་བྱ་བ་ནི་སྲིད་པའི་འགྲོ་བར་སྐྱེ་བ་མེད་པར་རྣམ་པར་ཤེས་པ་སྟེ།
en: The knowledge that a form of life in suffering existence is not produced” is a consciousness that birth in a form of life in suffering existence does not exist, which is to say the “knowledge of nonproduction” is the knowledge of subsequent purity. “

source: མི་སྐྱེ་བ་ཤེས་པ་ནི་རྗེས་སུ་དག་པའི་ཤེས་པའོ། །རྣམ་པར་གྲོལ་བ་མངོན་སུམ་དུ་བྱེད་པས། དེ་ལ་དམིགས་པ་ནི་ཆོས་ཤེས་པ་ཞེས་བྱའོ།
en: Knowledge of the dharma” is the direct realization of freedom that apprehends that nonproduction or emptiness.

source: །མི་རྟག་པ་ལ་སོགས་པ་ནི་རྗེས་སུ་དཔག་པ་ཡིན་པའི་ཕྱིར་དེ་ལ་དམིགས་པའི་ཤེས་པ་ནི་རྗེས་སུ་རྟོགས་པའི་ཤེས་པ་ཞེས་བྱའོ།
en: Impermanence and so on are inferred, so “subsequent realization knowledge” is the knowledge that apprehends those.

source: །ཁ་ཅིག་ཁོ་ནར་ཀུན་བརྟགས་པ་ལ་དམིགས་པའི་ཕྱིར་ཕ་རོལ་གྱི་སེམས་ཤེས་པ་ལ་ཀུན་རྫོབ་ཤེས་པ་ཞེས་བྱའོ།
en: It is just as an individual that you apprehend the falsely imagined, so “conventional knowledge” is knowledge of someone else’s thoughts. “

source: །ཡོངས་སུ་འདྲིས་པ་ཤེས་པ་ཞེས་བྱ་བ་ལ་ཡོངས་སུ་འདྲིས་པ་ནི་གོམས་པར་བྱེད་པ་སྟེ། སྒོམ་པ་ཞེས་བྱ་བ་དང་དོན་གཅིག་གོ།
en: Knowledge of mastery”— “mastery” is making yourself thoroughly familiar with something, the same as “meditation.”

source: །ཡོངས་སུ་འདྲིས་པ་ཡང་སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ཐམས་ཅད་དུ་ཟིལ་གྱིས་གནོན་ཞེས་བྱ་བ་དང་དོན་གཅིག་གོ།
en: Mastery is also the same as “totally vanquishing” bad, unwholesome dharmas.

source: །དེ་ལ་དོན་སྔ་མའི་རྣམ་པར་རྟོག་པ་ལ་ཡང་དག་པར་སྒྲུབ་པ་ཤེས་པ་ནི་ཡོངས་སུ་འདྲིས་པ་ཞེས་བྱའོ།
en: There, in the earlier idea, knowledge that accomplishes the final result is mastery.

source: །དོན་གཉིས་པའི་རྣམ་པར་རྟོག་པ་ལ་སྡིག་པ་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ཅིང་ཟད་པར་བྱས་པར་ཤེས་པ་ནི་ཡོངས་སུ་འདྲིས་པ་ཤེས་པ་སྟེ།
en: In the second idea, cognition that vanquishes and extinguishes all that is bad is knowledge of mastery.

source: དེའི་ཕྱིར་ལམ་ཤེས་པ་དང་། ཡོངས་སུ་ཟད་པ་ཤེས་པའོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Hence, it says “knowledge of the path and knowledge of extinction.”

source: །དེ་ལ་རྣམ་པ་སྔ་མ་ཡོངས་སུ་འདྲིས་པ་ཤེས་པ་འོག་མའི་བཤད་པ་མདོར་བསྡུ་སྟེ་འདི་ཉིད་དུ་བསྟན་པས་ཡང་མ་བཤད་དོ།
en: There, the earlier one teaches in brief that the knowledge of mastery explained below is just that, so it is not being explained again.

source: །སྒྲ་ཇི་བཞིན་ཤེས་པ་གང་ཞེ་ན་དེ་བཞིན་གཤེགས་པས་སྒྲ་ཐམས་ཅད་མཁྱེན་པ་སྟེ་ཞེས་བྱ་བ་ལ།
en: There, “what is knowledge in accord with sound? It is a tathāgata’s knowledge of all sounds.”

source: སྒྲ་ནི་བརྗོད་པ་སྟེ།
en: A sound is an expression.

source: འདུ་ཤེས་དང་བརྟགས་པ་ཞེས་བྱ་བ་ནི་རྣམ་གྲངས་ཏེ།
en: Name and label are synonyms.

source: སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོ་དང་མི་དང་ལྷ་ལ་སོགས་པའི་སྐད་གང་ཡིན་པ་དང་། བརྗོད་པ་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་རྟོག་པ་ལ་སྒྲ་ཇི་བཞིན་ཤེས་པ་ཞེས་བྱའོ།
en: The understanding of whatever the languages—whatever the expressions in the hells, among the animals, of humans, and of gods and so on—is “knowledge in accord with sound.”

source: །དབང་པོ་གསུམ་ཞེས་བྱ་བ་ནི་དབང་པོ་གསུམ་པོ་དག་ཐེག་པ་ཆེན་པོ་སྟེ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་རྣམས་རྣམ་པར་བྱང་བའི་ཆོས་རྣམས་ལ་དབང་བྱེད་པ་རྣམ་པར་གནས་པའི་ཕྱིར་རོ།
en: 13. Great Vehicle of the three faculties “The three faculties”— the three faculties are the Great Vehicle because they are the differentiators of the generators those in the Śrāvaka and Pratyekabuddha Vehicles use for purification dharmas. “

source: །ཀུན་ཤེས་པར་བྱེད་པའི་དབང་པོ་ནི་མཐོང་བའི་ལམ་ལའོ། །ཀུན་ཤེས་པའི་དབང་པོ་ནི་གཉིས་ཀ་ལའོ། །ཀུན་ཤེས་པ་དང་ལྡན་པའི་དབང་པོ་ནི་མི་སློབ་པའི་ལམ་ལའོ།
en: The faculty of coming to understand what one does not understand” facilitates the path of seeing; “the faculty of understanding” facilitates both; and “the faculty of having understood” facilitates the nontrainee path. “

source: །སྣང་བ་མེད་པ་དྲེགས་པ་འདུལ་བ་ཞེས་བྱ་བ་ནི་མཐོང་བའི་ལམ་ལ་དེ་བཞིན་ཉིད་མ་གཏོགས་པར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཆོས་ཐམས་ཅད་སྣང་བར་མི་འགྱུར་བ་དེའི་ཕྱིར་སྣང་བ་མེད་པ་ཞེས་བྱའོ།
en: Without appearances that tame the arrogance”— it says “without appearances” because for bodhisattvas on the path of seeing there is no appearance of any phenomenon apart from suchness.

source: །ཉོན་མོངས་པ་སྤང་བའི་ཕྱིར་དྲེགས་པ་འདུལ་བ་ཞེས་བྱའོ།
en: It says “tame the arrogance” because it eliminates the afflictions. 14.

source: །རྟོག་པ་དང་བཅས་དཔྱོད་པ་དང་བཅས་པ་ལ་སོགས་པ་ལ།
en: Great Vehicle of the three meditative stabilizations These are “the meditative stabilization with applied thought and with sustained thought” and so on.

source: ཏིང་ངེ་འཛིན་གསུམ་ནི་སེམས་ཀྱི་རྒྱུ་བ་རགས་པ་ཉིད་དང་། འབྲིང་དང་། ཕྲ་མོ་རྣམས་རྟོགས་པར་བྱ་བའི་ཕྱིར་ཏེ། རྟོག་པ་དང་བཅས་ཤིང་།
en: There are three meditative stabilizations because there has to be a realization of gross, middling, and subtle movement of thought. “

source: དཔྱོད་པ་དང་བཅས་པ་ནི་ཆེན་པོའོ། །རྟོག་པ་མེད་ལ་དཔྱོད་པ་དང་བཅས་པ་ནི་འབྲིང་ངོ་། །རྟོག་པ་མེད་ཅིང་དཔྱོད་པ་མེད་པ་ནི་ཕྲ་མོའོ།
en: With applied thought and with sustained thought” is the gross; “without applied thought with only sustained thought” is the middling; and “without either applied or sustained thought” is the subtle.

source: བསམ་གཏན་དང་། ཚད་མེད་པ་ལ་སོགས་པ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། བསྡུ་བ་དང་། དབང་ཐོབ་པར་བྱ་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་སོགས་པའི་ཕྱིར་རོ།
en: Great Vehicle of the mindfulnesses and the five absorptions The mindfulnesses… concentrations… and immeasurables and so on are to bring beings to maturity, to gather them, to gain control over them, and to bring the buddhadharmas to maturity and so on.

source: །དེ་ལ་ཚད་མེད་པ་བཞི་ཞེས་བྱ་བ་ནི། སེམས་ཅན་ཚད་མེད་པ་ལ་དམིགས་པ་དང་། ཚོགས་ཚད་མེད་པའི་རྒྱུར་གྱུར་པ་དང་། ཆོས་ཚད་མེད་པ་ཐོབ་པའི་རྒྱུར་གྱུར་པ་དང་། ཡེ་ཤེས་ཚད་མེད་པའི་སྤྱོད་ཡུལ་དུ་གྱུར་པའི་ཕྱིར་ཚད་མེད་པ་ཞེས་བྱའོ།
en: Among them “the four immeasurables” are “immeasurable” because they focus on immeasurable beings, are the cause of an immeasurable accumulation, are the cause of the attainment of immeasurable dharmas, and are the object of an immeasurable knowledge.

source: །དེ་ལ་བྱམས་པ་ནི་རྣམ་པ་གསུམ་སྟེ། མོས་པས་སྤྱོད་པའི་ས་ལ་ནི་སེམས་ཅན་ལ་དམིགས་པའོ། །ས་དང་པོ་ནས་ས་བདུན་པའི་བར་དུ་ནི་དེ་བཞིན་ཉིད་ལ་དམིགས་པའོ། །ས་བརྒྱད་པ་ཡན་ཆད་ནི་དམིགས་པ་མེད་པའོ།
en: There, there are three types of love: the one that takes beings as its objective support on the devoted course of conduct level, the one that takes suchness as its objective support on the first to the seventh levels, and from the eighth level on up the one that does not apprehend anything.

source: །སྙིང་རྗེ་ལ་ཡང་རྣམ་པ་གསུམ་སྟེ། སེམས་ཅན་སྡུག་བསྔལ་བ་ལ་དམིགས་པ་དང་། ཉེས་པར་སྤྱོད་པ་མང་བའི་སེམས་ཅན་ལ་དམིགས་པ་དང་། རྐྱེན་དང་མི་ལྡན་པས་རྣམ་པར་མ་གྲོལ་བའི་སེམས་ཅན་ལ་དམིགས་པའོ།
en: There are also three types of compassion: the one that takes suffering beings as its objective support, the one that takes beings who are involved in much misconduct as its objective support, and the one that takes beings without the necessary conditions for freedom as its objective support.

source: །དགའ་བ་ཡང་རྣམ་པ་གསུམ་སྟེ། བདེ་བའི་སེམས་ཅན་ལ་དམིགས་པ་དང་། བདག་གི་ཚོགས་ཡོངས་སུ་རྫོགས་པ་ལ་དམིགས་པ་དང་། དམ་པའི་ཆོས་ཀྱི་རོ་མྱང་བ་ལ་དམིགས་པའོ།
en: There are also three types of joy: the one that takes happy beings as its objective support, the one that takes those who have accumulated their collections as its objective support, and the one that takes those who have experienced the taste of the good doctrine as its objective support.

source: །བཏང་སྙོམས་ལ་ཡང་རྣམ་པ་གསུམ་སྟེ། སེམས་ཅན་གྱི་དོན་སྤྱད་པ་དག་ལ་སྐལ་བ་ཡོད་པ་དང་། སྐལ་བ་མེད་པ་ལ་དམིགས་པ་དང་། རྙེད་པ་དང་མ་རྙེད་པ་ལ་སོགས་པ་འཇིག་རྟེན་གྱི་ཆོས་རྣམས་ལ་མཉམ་པ་ཉིད་དུ་དམིགས་པ་དང་། ཚོགས་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་དུས་དང་དུས་མ་ཡིན་པ་ལ་དམིགས་པའོ།
en: And there are also three types of equanimity: the one that, when conducting themselves for the welfare of others, apprehends those who are fortunate and those without good fortune; the one that apprehends in a state of equanimity the conditions of attaining and not attaining and so on governing an ordinary person’s life; and the one that apprehends, in respect to the completion of the accumulations, when is and is not the time.

source: །དེ་ལ་བྱམས་པ་དང་ལྡན་པའི་སེམས་ཞེས་བྱ་བས་ནི་ཡོན་ཏན་ཅན་བསྟན་ཏོ། །ཡངས་པ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་ཡོན་ཏན་ཉིད་བསྟན་པའོ།
en: There, “a mind endowed with love” teaches that it is endowed with good qualities; “vast” and so on teaches the actual good qualities.

source: །ཡོན་ཏན་ཅན་ཡང་རྣམ་པ་གསུམ་སྟེ། ཆེ་བ་ཉིད་དང་། གཅིག་པའི་བདག་ཉིད་དང་། གནོད་པ་སྤོང་བའོ།
en: Again, the good qualities are three: greatness, unity, and the elimination of enmity.

source: །ཆེ་བ་ཡང་རྣམ་པ་གསུམ་གྱིས་བསྟན་ཏེ། བསམ་པ་དང་། འཕེལ་བ་དང་། དམིགས་པས་སོ།
en: It teaches that the mind is great in three ways: because of intention, increase, and objective support.

source: །དེ་ལ་བསམ་པས་ཆེ་བ་ནི་ཡངས་པ་ཞེས་གསུངས་པའོ། །འཕེལ་བས་ཆེ་བ་ནི་རྒྱ་ཆེན་པོར་གྱུར་པ་ཞེས་གསུངས་པའོ། །དམིགས་པས་ཆེ་བ་ནི་སེམས་ཅན་ཚད་མེད་པ་ལ་དམིགས་པའི་ཕྱིར་ཚད་མེད་པ་ཞེས་གསུངས་པའོ།
en: There it is great because of its intention so it says “vast”; it is great because of its increase so it says “inclusive”; and because it has immeasurable beings for its objective support it is great because of its objective support, so it says “infinite.”

source: །རྣམ་པར་མི་རྟོག་པ་དང་། བྱམས་པའི་རྣམ་པར་གཅིག་པའི་ཕྱིར་བདག་ཉིད་གཅིག་པ་ནི་མི་གཉིས་པ་ཞེས་གསུངས་པའོ། །རྣམ་པར་འཚེ་བའི་གཉེན་པོར་གྱུར་པའི་ཕྱིར་ནང་གི་ཆོས་ལས་གྱུར་པའི་གནོད་པ་མེད་པ་ནི་ཁོན་མེད་པ་ཞེས་གསུངས་པའོ།
en: It is a unity because it is without thought construction and in the form of love alone, so it says “nondual.”

source: །ཕྱི་རོལ་གྱི་སེམས་ཅན་གྱིས་བྱས་པའི་གནོད་པ་མེད་པ་ནི་འགྲན་ཟླ་མེད་པ་ཞེས་གསུངས་པའོ། །ཕྱི་རོལ་དང་འདུ་བྱེད་ལས་གྱུར་པའི་གནོད་པ་མེད་པ་ནི་གནོད་པ་མེད་པ་ཞེས་གསུངས་པ་སྟེ། འདོད་ཆགས་དང་། དུག་དང་། མེ་ལ་སོགས་པའི་གནོད་པ་མེད་པའི་ཕྱིར་རོ།
en: Because it functions to counteract violence it is not harmed by inner dharmas, so it says “without enmity”; because it is not harmed by outer beings it says “unrivaled”; because it is not harmed by external and karmically occasioned things it says “not harmful,” which is to say, it is not harmed by attachments, poisons, fire and so on.

source: །བསམ་གཏན་བཞི་ཞེས་བྱ་བ་དེ་ལ། འདོད་པ་དག་ལས་དབེན་ཞེས་བྱ་བ་ནི་ཉོན་མོངས་པའི་འདོད་པ་དང་། དངོས་པོ་ལ་འདོད་པ་དག་ལས་དབེན་པ་སྟེ། མཚུངས་པར་ལྡན་པ་ལས་དབེན་པ་དང་། དམིགས་པ་ལས་དབེན་པའི་ཕྱིར་རོ།
en: As for “the four concentrations,” the first is “detached from sense objects,” detached from both sense objects—from the afflictive emotion of desire, and from the bases—because of detachment from a state accompanied by it and because of detachment from having those bases as its objective support. “

source: །སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ་ཞེས་བྱ་བ་ནི་གང་དག་ཉོན་མོངས་པའི་འདོད་པའི་རྒྱུ་ལས་བྱུང་བའི་ལུས་དང་ངག་དང་ཡིད་ཀྱིས་ཉེས་པར་སྤྱོད་པར་གཏོགས་པ། ཆད་པས་གཅོད་པ་དང་། མཚོན་གྱིས་འདེབས་པ་དང་། འཐབ་པ་དང་། རྩོད་པ་དང་། འགྱེད་པ་དང་། གཡོའི་ཚིག་དང་། གནོད་པ་དང་། {བརྫུན་,རྫུན་}དུ་སྨྲ་བ་ལ་སོགས་པ་དེ་དག་ལས་དབེན་པའོ།
en: Detached from wrong unwholesome dharmas” is detachment from what is included in physical, verbal, and mental wrongdoing: harsh punishments, striking with weapons, wars, arguments, battles, making deceitful statements, harming, lying and so on—anything caused by the afflictive emotion of desire.

source: །རྣམ་པར་རྟོག་པ་དང་། རྣམ་པར་དཔྱོད་པ་དག་སྐྱོན་དུ་མ་མཐོང་བས། འདོད་པའི་གཉེན་པོ་དེ་གཉིས་དང་མཚུངས་པར་ལྡན་པ་འདོད་པ་ལས་དབེན་པའམ།
en: Because of not seeing “applied thought and sustained thought” as faults, this concentration that counteracts desire for sense gratification is accompanied by those two. “

source: སྒྲིབ་པ་ལས་དབེན་པ་སྐྱེས་པའི་ཕྱིར་དབེན་པ་ལས་སྐྱེས་པའོ།
en: Born of detachment”— it is born of detachment from sense objects or from being detached from wrongdoing.

source: །འདོད་པའི་དོན་རྙེད་ནས་གནས་ངན་ལེན་ཐམས་ཅད་དང་བྲལ་བས་ལུས་དང་སེམས་ཤིན་ཏུ་སྦྱངས་ཏེ། ལས་སུ་རུང་བའི་ཕྱིར་དགའ་བ་དང་བདེ་བ་དང་ལྡན་པའོ།
en: It has “joy and happiness” because the body and mind are pliable, and do what they do with a sense of ease, because, having reached the desired goal, it is separated from all the defective states.

source: །བསམ་གཏན་གཉིས་པ་ལ་ནི་རྣམ་པར་རྟོག་པ་དང་བཅས་རྣམ་པར་དཔྱོད་པ་དང་བཅས་པའི་ཏིང་ངེ་འཛིན་གྱི་མཚན་མ་དག་ལ་སྐྱོན་དུ་མཐོང་ནས་དེ་ལས་སེམས་བཟློག་སྟེ།
en: In the second concentration, having seen the causal signs of the meditative stabilization as faulted by the presence of applied and sustained thought, the mind recoils from them.

source: རྣམ་པར་རྟོག་པ་མེད་པ་དང་རྣམ་པར་དཔྱོད་པ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱི་མཚན་མ་ལ་སེམས་ཉེ་བར་འདོགས་ཤིང་གཡེང་བར་སྤྱོད་པའི་དམིགས་པ་དང་བྲལ་བར་བྱས་ནས་སེམས་རྩེ་གཅིག་ཏུ་སྤྱོད་པའི་དམིགས་པ་ལ་ཚུལ་གཅིག་པས་ཞི་བ་དང་རབ་ཏུ་དང་བའི་སེམས་སུ་འཇོག་གོ།
en: Having made the causal signs of the meditative stabilization without applied and sustained thought attractive to the mind, and separated it from being distracted by distracting objects, the mind, focused single-pointedly in a unified fashion, is calm and placed in a serene confidence.

source: །དེ་བས་ན་དེ་རྟོག་པ་དང་། དཔྱོད་པ་དང་བྲལ་ཞིང་ནང་ཡོངས་སུ་དང་སྟེ་ཞེས་བྱ་བ་གསུངས་སོ། །དེ་དེ་ལྟར་སེམས་ཉེ་བར་འཇོག་པས་རྣམ་པར་རྟོག་པ་དང་བཅས། རྣམ་པར་དཔྱོད་པ་དང་བཅས་པས་གླགས་དང་བཅས་ཤིང་།
en: Therefore, it says “relieved of applied thought and sustained thought, with an inner serene confidence.”

source: བར་ཆད་དང་བཅས་པའི་གནས་སྐབས་ལས་འདས་ནས་བསྒོམ་པ་གོམས་པས་གླགས་མེད་ཅིང་བར་ཆད་མེད་པའི་གནས་སྐབས་ཐོབ་པར་འགྱུར་ཏེ།
en: With the mind thus settled close by, having passed beyond the danger from applied and sustained thought and states where they are an obstruction, because of habituation to the meditation they attain a state where the danger and obstruction do not exist.

source: དེ་བས་ན་སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་ཞེས་བྱ་བ་གསུངས་སོ།
en: Therefore, it says “and a mind that has become a single continuum.”

source: །རྣམ་པར་རྟོག་པ་དང་བཅས་ཤིང་རྣམ་པར་དཔྱོད་པ་དང་བཅས་པ་ཐམས་ཅད་ཀྱིས་ཐམས་ཅད་དུ་སྤངས་པས་རྟོག་པ་མེད་པ་དཔྱོད་པ་མེད་པའོ།
en: They are “without applied thought and without sustained thought” because they have eliminated, in each and every way, applied and sustained thought.

source: །བསམ་གཏན་གསུམ་པ་ལ། དེ་དགའ་བའི་འདོད་ཆགས་དང་བྲལ་བས་བཏང་སྙོམས་ལ་གནས་ཤིང་དྲན་པ་དང་། ཤེས་བཞིན་ཅན་ཡིན་ཏེ་བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ་ཞེས་བྱ་བ་ལ་བཏང་སྙོམས་སུ་གནས་པ་དང་།
en: In the third concentration, “because they are free from attachment to joy they abide in equanimity, and with equanimity and recollection and introspection experience happiness with their body.”

source: བདེ་བ་མྱོང་བ་དག་འགལ་ལོ་སྙམ་དུ་སེམས་པ་ལ། དེ་གཉིས་མི་འགལ་བར་སྒྲུབ་པ་སྟོན་ཏེ།
en: For those who think abiding in equanimity, and experiencing pleasure, are mutually exclusive, it teaches a practice where they do not exclude each other.

source: བསམ་གཏན་པ་དེ་རྣམ་པར་རྟོག་པ་དང་བཅས། རྣམ་པར་དཔྱོད་པ་དང་བཅས་པ་དེ་དག་དང་། དགའ་བ་ཡང་སྤངས་པས། བར་ཆད་མེད་པར་བཏང་སྙོམས་དང་ལྡན་པར་གནས་སོ།
en: In this concentration, applied and sustained thought have been eliminated, as well as enjoyment, so without obstructions they “abide in equanimity.”

source: །དེ་ཡང་དགའ་བ་དང་ལྡན་པའི་འདུ་ཤེས་ཡིད་ལ་བྱེད་པ་རྣམས་ཀྱི་གོ་སྐབས་མི་དབྱེ་བའི་ཕྱིར་དྲན་པ་ཉེ་བར་གནས་པ་ཡིན་ནོ།
en: Furthermore, in order not to open up any opportunities for paying attention to perceptions of enjoyment they remain mindful.

source: །སྐྱེས་པ་རྣམས་ཀྱང་ནམ་ཡང་ཇི་ལྟར་ཡང་དང་ཡང་དུ་མི་བླང་བའི་ཕྱིར་ཤེས་རབ་ཀྱིས་མང་དུ་གནས་སོ།
en: In order not to cause those that have been produced to arise, as they have again and again, they remain at their post with wisdom.

source: །དེ་བས་ན་དྲན་པ་དང་ལྡན་ཞིང་ཤེས་བཞིན་ཅན་ཞེས་བྱའོ།
en: Therefore it says “with recollection and introspection.”

source: །དེ་ལྟར་བཏང་སྙོམས་ལ་མང་དུ་གནས་པ་དེ་སེམས་གཡེང་བར་བྱེད་པའི་དགའ་བ་དང་ལྡན་པའི་ཚོར་བ་སྤངས་ནས། དགའ་བ་མེད་པ་ཞི་བ་རབ་ཏུ་ཞི་བའི་ཚོར་བ་སྐྱེ་སྟེ། དེ་ཡང་དེའི་ཚེ་གཟུགས་ཀྱི་ལུས་དང་། ཡིད་ཀྱི་ལུས་ཀྱི་ཚོར་བའི་བདེ་བ་དང་། ཤིན་ཏུ་སྦྱངས་པའི་བདེ་བ་མྱོང་བར་བྱེད་དོ།
en: Thus in equanimity, those staying at their post, having eliminated the feeling of enjoyment that causes the mind to become distracted, produce a feeling of extreme calm, a calm in which there is no enjoyment, and that also at that time causes an experience of a pleasurable feeling and an experience of the pleasure of pliancy in their physical body and mental body.

source: །དེ་བས་ན་བདེ་བ་ལུས་ཀྱིས་མྱོང་བ་ཞེས་བྱའོ། །འཕགས་པ་རྣམས་ཀྱིས་གང་དེ་དྲན་པ་དང་ལྡན་པ་བདེ་བ་ལ་གནས་པ་བཏང་སྙོམས་པའོ་ཞེས་བརྗོད་པ་སྟེ་ཞེས་བྱ་བ་ནི་བསམ་གཏན་འོག་མ་གཉིས་ལ་དེ་ལྟ་བུའི་བདེ་བ་དང་། བཏང་སྙོམས་མེད་དོ།
en: Thus it says “experience pleasure with their body… about which the noble beings say, ‘They have equanimity and recollection and dwell in pleasure.’ ” In the lower two concentrations such pleasure and equanimity do not exist.

source: །གོང་མ་ལ་ནི་བཏང་སྙོམས་ཡོད་ལ་བདེ་བ་མེད་དོ།
en: In the one above, equanimity but not pleasure exists.

source: །དེ་བས་ན་བསམ་གཏན་གསུམ་པ་འདི་ཉིད་བདེ་བ་དང་བཏང་སྙོམས་ཀྱི་གནས་ཡིན་པས་འཕགས་པ་སངས་རྒྱས་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཉན་ཐོས་རྣམས་ཀྱིས་བསམ་གཏན་པ་འདི་ཉིད་ལ་བཏང་སྙོམས་པ། བདེ་བ་ལ་གནས་པ། དྲན་པ་དང་ལྡན་པའོ་ཞེས་གཙོ་བོར་གསུངས་སོ།
en: Therefore, since just this third concentration is the abode of pleasure and equanimity, the buddhas and the buddhas’ śrāvakas say primarily of just those in this concentration that “they have equanimity and recollection and dwell in pleasure.”

source: །བསམ་གཏན་བཞི་པ་ལ་བདེ་བ་ཡང་སྤངས་ཞེས་བྱ་བ་ནི་བསམ་གཏན་གསུམ་པ་དང་ལྡན་པའི་བདེ་བ་བསམ་གཏན་བཞི་པ་འདིས་སྤངས་པར་བསྟན་པའོ།
en: In the fourth concentration “they have forsaken pleasure.” This teaches that this fourth concentration has forsaken the pleasure with which the third concentration is endowed.

source: །སྔ་ནས་སྡུག་བསྔལ་ཡང་སྤངས་ཞེས་བྱ་བ་ནི་བསམ་གཏན་གཉིས་པས་སྤངས་པ་ཡང་བསྡུས་ཏེ་བསྟན་པའོ།
en: That they also “have earlier forsaken suffering” includes in the explanation what has been forsaken by the second concentration.

source: །སྔ་ནས་ཞེས་བྱ་བ་དང་། ཡིད་བདེ་བ་ནུབ་པས་ཞེས་བྱ་བ་ནི་བསམ་གཏན་གསུམ་པ་ལ་དགའ་བ་སྤངས་པ་བསྟན་པའོ།
en: That they “earlier” “set to rest mental happiness” teaches that enjoyment has been forsaken in the third concentration.

source: །ཡིད་མི་བདེ་བ་ནུབ་པས་ཞེས་བྱ་བ་ནི་བསམ་གཏན་གཉིས་པས་སྤངས་པ་བསྟན་པའོ།
en: That they “set to rest” “mental unhappiness” teaches that it has been forsaken by the second concentration as well.

source: །བཏང་སྙོམས་དང་། དྲན་པ་དང་། ཤེས་བཞིན་རྣམས་འདིར་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཐོབ་པའི་ཕྱིར་སྔར་སྤངས་པ་རྣམས་ཀྱང་འདིར་བསྡུ་བར་བྱའོ།
en: Because an extremely purified equanimity, recollection, and introspection are obtained here, what have been forsaken earlier are included.

source: །ཚོར་བ་བཞི་པོ་འདི་དག་སྤངས་པས་སྡུག་བསྔལ་ཡང་མ་ཡིན་བདེ་བ་ཡང་མ་ཡིན་པའི་ཚོར་བ་ཕྱི་ན་ཡོད་པའི་ཕྱིར། བདེ་བ་ཡང་མ་ཡིན་སྡུག་བསྔལ་ཡང་མ་ཡིན་ཞེས་བྱ་བ་གསུངས་སོ།
en: Because these four feelings have been forsaken it also has a feeling beyond them that is neither pleasure nor suffering, so it says “that is neither happiness nor suffering.” “

source: །བཏང་སྙོམས་དང་དྲན་པ་ཡོངས་སུ་དག་ཅེས་བྱ་བ་ནི་བསམ་གཏན་བཞི་པ་མི་གཡོ་བ་ཉིད་ཡིན་པའི་རྒྱུ་བསྟན་ཏོ།
en: Extremely pure equanimity and recollection” teaches the cause of the fourth concentration’s immovability.
